const width=$(window).get(0).innerWidth;
const height=$(window).get(0).innerHeight;
const bsize=10;
const n=width/bsize,m=height/bsize;
const speed=100;
const texts=[
	"我是幼苗，你是雨露，滋润我干涸的心田。我是小草，你是太阳，照耀我成长的路。",
	"如果生活里没有老师，就好像万物没有阳光；如果智慧里没有老师，就好像鸟儿没有翅膀。",
	"十年前，我想成为您，因为您照明了我的人生；十年后，我成为了您，所以照亮了别人的人生。",
	"您的工作在今朝，却建设着祖国的明天；您的教学在课堂，成就却是在祖国的四面八方。",
	"三尺讲台站八斗学士，学士含辛育学子；一尺课桌载千秋之梦，千万银丝托伟业。",
	"相处虽短，涌泉终生。授课有限，获益无穷。佳节思亲，感恩激情。老师，您是最可敬的人。",
	"世界上有一种情，超越了亲情、友情，那就是老师对我们无微不至的关怀之情，对我们细心的教导之情。",	
	"教书一分育人，赢得十分尊敬，社会百分爱师，浙江千分重教，师生万分幸福!",
	"高山在欢呼，流水在歌唱；太阳在欢笑，小草在舞蹈：赞美您，为人师表，劳苦功高!",
	"从力的角度分析，您是我们的源动力；我们会用更快更强的加速度，冲击知识的高峰。",
	"您的亲切眼神，如片片云朵，飘在我心灵的晴空上。您的娓娓教导，似潺潺清泉，流在我生命的河床里。",
	"言行上体现老师教导的道理，工作中运用老师传授的知识，人生中永远记住老师的恩情。"
];
const colors=["red","orange","green","blue","purple","brown","black"];